Revit 2027 API
RebarConstraint.GetConstraintToRebarEdgeProperties Method
 Gets the properties for all target rebar edges.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ConstraintToRebarEdgeProperties> GetConstraintToRebarEdgeProperties()
Public Function GetConstraintToRebarEdgeProperties As IList(Of ConstraintToRebarEdgeProperties)
public:
IList<ConstraintToRebarEdgeProperties^>^ GetConstraintToRebarEdgeProperties()
member GetConstraintToRebarEdgeProperties : unit -> IList<ConstraintToRebarEdgeProperties>
Return Value
IList<ConstraintToRebarEdgeProperties>
 Returns the properties for all target rebar edges.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstraint is no longer valid. -or- The TargetRebarConstraintType should be 'Edge'.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace